app/Controllers/frontend/ProductController.php

    public function index()
    {
       $model= new ProductModel();
       $data= $model->findAll();
---
SELECT *
FROM `products`