app/Controllers/SigninController.php

SELECT *
FROM `users`
WHERE `email` = 'jitu@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $userModel =  new UserModel();
        $email =  $this->request->getVar('email');
        $formpass =  $this->request->getVar('password');
        // $formpass=password_hash($formpass, PASSWORD_DEFAULT);
        $data = $userModel->where('email', $email)->first();